Revit 2027 API
RebarInSystem.NumberOfBarPositions Property
 The number of bar positions available in the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfBarPositions { get; }
Public ReadOnly Property NumberOfBarPositions As Integer
	Get
public:
property int NumberOfBarPositions {
	int get ();
}
member NumberOfBarPositions : int with get
Property Value
Int32
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace